Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment.SurfaceColorEnum Enumeration
 The different surfacing colors.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SurfaceColorEnum
Public Enumeration SurfaceColorEnum
Members
Member name | Value | Description
WHITE | 1 |  The white surface color.
RED | 2 |  The red surface color.
GREEN | 3 |  The green surface color.
BLUE | 4 |  The blue surface color.
CYAN | 5 |  The cyan surface color.
YELLOW | 6 |  The yellow surface color.
MAGENTA | 7 |  The magenta surface color.
See Also
Reference
Tekla.Structures.Model Namespace